---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionOffset
source: html/20d6a11a-7a71-c042-059e-f4211ea0b077.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionOffset Property

"Angular Dimension Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeAngularDimensionOffset { get; }
```